<?php
namespace Database\Seeders;
use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
class PermissionTableSeeder extends Seeder
{
/**
* Run the database seeds.
*
* @return void
*/
public function run()
{


$permissions = [
        'الرئسية',
        'المحاسبة',
        'دليل الحسابات',
        'اضافة حساب',
        'تعديل حساب',
        'حذف حساب',
        'مراكز التكلفة',
        'اضافة مركز',
        'تعديل مركز',
        'حذف مركز',
        'القيود اليومية',
        'اضافة قيد',
        'تعديل قيد',
        'حذف قيد',
        'ميزان المراجعة',
        'كشف حساب',
        'كشف حساب مشروع',
        'قائمة الدخل',
        'المخازن',
        'اقسام المخازن',
        'المنتجات',
        'اضافة منتج',
        'تعديل منتج',
        'حذف منتج',
        'الموردين',
        'العملاء',
        'العروض',
        'اضافة عرض',
        'تعديل عرض',
        'حذف عرض',
        'اضافة فاتورة بيع',
        'اذن صرف',
        'قائمة المبيعات',
        'فواتير مرتجع المبيعات',
        'اضافة فاتورة شراء',
        'طلب شراء',
        'اذن اضافة',
        'قائمة المشتريات',
        'فواتير مرتجع المشتريات',
        'تقرير المخزون',
        'المستخدمين',
        'قائمة المستخدمين',
        'صلاحيات المستخدمين',    
        'الاعدادات',
        'اضافة مستخدم',
        'تعديل مستخدم',
        'حذف مستخدم',
        'عرض صلاحية',
        'اضافة صلاحية',
        'تعديل صلاحية',
        'حذف صلاحية',
];



foreach ($permissions as $permission) {

Permission::create(['name' => $permission]);
}


}
}